# UpdateVerticalHeadersInSection Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..UpdateVerticalHeadersInSection Method
PanelScheduleData Class See Also
---
Sets if this header should have vertical text
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void UpdateVerticalHeadersInSection(
	SectionType sectionType,
	bool bVertical
)
```

Visual Basic
---
```text
Public Sub UpdateVerticalHeadersInSection ( _
	sectionType As SectionType, _
	bVertical As Boolean _
)
```

Visual C++
---
```text
public:
void UpdateVerticalHeadersInSection(
	SectionType sectionType,
	bool bVertical
)
```

# ### Parameters
sectionType
    Type: Autodesk.Revit.DB..::..SectionType The section type
bVertical
    Type: System..::..Boolean Whether headers are vertical or not
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace